# running in id_ex_cover_cover/src/
read -formal id_ex_formal.sv
read -formal -D FORMAL id_ex_wrapper.v
read -formal id_stage.v
read -formal ex_stage.v
read -formal regfile.v
read -formal alu.v
read -formal conv_pe.v
prep -top id_ex_wrapper -flatten

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
