# ------------------------------------------------------------
# READ LIBERTY 
# ------------------------------------------------------------
read_liberty /home/asiclab/.ciel/ciel/sky130/versions/0fe599b2afb6708d281543108caf8310912f54af/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib

# ------------------------------------------------------------
# READ SYNTHESIZED NETLIST
# ------------------------------------------------------------
read_verilog LUT_synth.v

# ------------------------------------------------------------
# LINK DESIGN
# ------------------------------------------------------------
link_design LUT

# ------------------------------------------------------------
# READ CONSTRAINTS
# ------------------------------------------------------------
read_sdc sta.sdc

# ------------------------------------------------------------
# CLOCK PROPAGATION
# ------------------------------------------------------------
set_propagated_clock [all_clocks]

# ------------------------------------------------------------
# ANALYZE BOTH MODES 
# ------------------------------------------------------------

# COMBINATIONAL MODE
set_case_analysis 0 [get_ports is_sync]
report_power > power_comb.rpt

# SYNCHRONOUS MODE
set_case_analysis 1 [get_ports is_sync]
report_power > power_sync.rpt

# ------------------------------------------------------------
# END
# ------------------------------------------------------------