# running in fifo_system_top/src/
read -formal fifo_system_top.v
read -formal write_module.v
read -formal read_module.v
read -formal Async_fifo.v
read -formal fifo_mem.v
read -formal fifo_wr.v
read -formal fifo_rd.v
read -formal DF_Sync.v
read -formal fifo_system_top_formal.sv

prep -top fifo_system_top_formal

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
