# Read design
read_verilog LUT.v

# Set top
hierarchy -top LUT

# Load liberty
read_liberty -lib /home/asiclab/.ciel/ciel/sky130/versions/0fe599b2afb6708d281543108caf8310912f54af/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib

# Use built-in synthesis flow (IMPORTANT)
synth -top LUT

# Map flip-flops
dfflibmap -liberty /home/asiclab/.ciel/ciel/sky130/versions/0fe599b2afb6708d281543108caf8310912f54af/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib

# Map logic
abc -liberty /home/asiclab/.ciel/ciel/sky130/versions/0fe599b2afb6708d281543108caf8310912f54af/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib

# Clean
opt_clean

# Write clean gate-level netlist
write_verilog -noattr -noexpr LUT_synth.v

# ============================================================
# ------------------------------------------------------------
# SHOW NETLIST
# ------------------------------------------------------------
# Print netlist in terminal
show
# ============================================================