# running in riscv_conv_prove/src/
read -formal riscv_props.v
read -formal riscv_top.v
read -formal if_stage.v
read -formal id_stage.v
read -formal ex_stage.v
read -formal mem_stage.v
read -formal wb_stage.v
read -formal regfile.v
read -formal alu.v
read -formal conv_pe.v
read -formal imem.v
read -formal dmem.v
prep -top riscv_top

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
